first_app/app/controllers/resumes_controller.rb

SELECT "resumes".* FROM "resumes"
---
   def index
      @resumes = Resume.all

INSERT INTO "resumes" ("name", "attachment", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "spike"], ["attachment", "base_rules_ZT581KL.mk"], ["created_at", "2017-01-24 08:23:33.140790"], ["updated_at", "2017-01-24 08:23:33.140790"]]
---
   def create
      @resume = Resume.new(resume_params)
      #@resume = Resume.new()

      if @resume.save

SELECT  "resumes".* FROM "resumes" WHERE "resumes"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "resumes" WHERE "resumes"."id" = ?  [["id", 1]]
---
   def destroy
      @resume = Resume.find(params[:id])
      @resume.destroy

SELECT  "resumes".* FROM "resumes" WHERE "resumes"."id" = ? LIMIT 1  [["id", nil]]
---
   def download
      @resume = Resume.find(params[:resume_id])